app/views/employees/show.html.erb

    <blockquote>
      <% if @employee.adjustments.any? %>
        <% @employee.adjustments.each do |adj| %>
---
SELECT "adjustments".* FROM "adjustments" WHERE "adjustments"."employee_id" = ?  [["employee_id", 20]]
SELECT  1 AS one FROM "adjustments" WHERE "adjustments"."employee_id" = ? LIMIT ?  [["employee_id", 20], ["LIMIT", 1]]