app/views/payrolls/analytics.html.erb

    <tbody>
      <% if current_company.payrolls.any?%>
        <% current_company.payrolls.limit(5).reverse.each do |pr| %>
---
SELECT  1 AS one FROM "payrolls" WHERE "payrolls"."company_id" = ? LIMIT ?  [["company_id", 4], ["LIMIT", 1]]
SELECT  "payrolls".* FROM "payrolls" WHERE "payrolls"."company_id" = ? LIMIT ?  [["company_id", 4], ["LIMIT", 5]]

            <td><%= link_to "#{pr.start_date } - #{pr.end_date}", analytics_show_path(pr.id) %></td>
            <td>$<%= pr.hourly_paychecks.sum { |pc| pc.total_pay_amt} %></td>
---
SELECT "paychecks".* FROM "paychecks" WHERE "paychecks"."payroll_id" = ?  [["payroll_id", 1]]