app/views/payrolls/index.html.erb

  <tbody>
    <% current_company.payrolls.reverse.each do |pr| %>
---
SELECT "payrolls".* FROM "payrolls" WHERE "payrolls"."company_id" = ?  [["company_id", 4]]