app/views/payrolls/show.html.erb

<br>
<% @payroll.paychecks.each do |paycheck| %>
---
SELECT "paychecks".* FROM "paychecks" WHERE "paychecks"."payroll_id" = ?  [["payroll_id", 2]]


        <% if !paycheck.paycheck_adjustments.empty? %>
          <h3><b><u>Adjustments</u></b></h3>
          <% paycheck.paycheck_adjustments.each do |adj| %>
---
SELECT  1 AS one FROM "paycheck_adjustments" WHERE "paycheck_adjustments"."paycheck_id" = ? LIMIT ?  [["paycheck_id", 13], ["LIMIT", 1]]
SELECT "paycheck_adjustments".* FROM "paycheck_adjustments" WHERE "paycheck_adjustments"."paycheck_id" = ?  [["paycheck_id", 13]]

      <div class="col-sm" style="align: bottom;">
        <% adds = paycheck.paycheck_adjustments.where(adj_type: "Addition") %>
        <% deds = paycheck.paycheck_adjustments.where(adj_type: "Deduction") %>
---
SELECT "paycheck_adjustments".* FROM "paycheck_adjustments" WHERE "paycheck_adjustments"."paycheck_id" = ? AND "paycheck_adjustments"."adj_type" = ?  [["paycheck_id", 17], ["adj_type", "Addition"]]
SELECT "paycheck_adjustments".* FROM "paycheck_adjustments" WHERE "paycheck_adjustments"."paycheck_id" = ? AND "paycheck_adjustments"."adj_type" = ?  [["paycheck_id", 13], ["adj_type", "Addition"]]