app/views/companies/_home.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ?  [["company_id", 4]]
---
  <div class="well well-sm">
    <a class="dropdown-item" href="/employees"><span class="glyphicon glyphicon-list-alt" style="margin-right: 15px"></span><b> All Employees </b> <span class="badge badge-light purple-button" style="margin-left: 5px"><%= current_company.employees.length %></span></a>

SELECT "payrolls".* FROM "payrolls" WHERE "payrolls"."company_id" = ?  [["company_id", 4]]
---
  <div class="well well-sm">
    <a class="dropdown-item" href="/payrolls"><span class="glyphicon glyphicon-list-alt" style="margin-right: 17.5px"></span><b> All Payrolls </b> <span class="badge badge-light purple-button" style="margin-left: 17.5px"><%= current_company.payrolls.length %></span></a>

SELECT "adjustments".* FROM "adjustments" INNER JOIN "employees" ON "adjustments"."employee_id" = "employees"."id" WHERE "employees"."company_id" = ?  [["company_id", 4]]
---
  <div class="well well-sm">
    <a class="dropdown-item" href="/adjustments"><span class="glyphicon glyphicon-list-alt" style="margin-right: 15px"></span><b> All Adjustments </b> <span class="badge badge-light purple-button" style="margin-left: 10px"><%= current_company.adjustments.length %></span></a>

SELECT "payrolls".* FROM "payrolls" WHERE "payrolls"."company_id" = ?  [["company_id", 4]]
---
  <div class="well well-sm">
    <a class="dropdown-item" href="/payrolls/analytics"><span class="glyphicon glyphicon-list-alt" style="margin-right: 15px"></span><b> Payroll Analytics </b> <span class="badge badge-light purple-button" style="margin-left: 10px"><%= current_company.payrolls.length %></span></a>