app/views/companies/show.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ?  [["company_id", 4]]
---

<% @company.employees.each do |employee| %>