app/controllers/adjustments_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def find_employee
    @employee = Employee.find(params[:id])