app/controllers/application_controller.rb

  def current_company
    if session[:company_id]
      Company.find(session[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]