app/controllers/companies_controller.rb

UPDATE "companies" SET "password_digest" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["password_digest", "$2a$10$5ZfCMw3fjetbT/7aTkZtIe2uwrKlawqxqJjfJciQ8BghCuQ.63dIm"], ["updated_at", "2019-08-01 19:29:03.977085"], ["id", 4]]
---
  def update
    @company.update(company_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_company
    @company = Company.find(params[:id])