app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ? AND "employees"."active" = ? ORDER BY last_name  [["company_id", 4], ["active", 1]]
---
  def index
    @employees = current_company.employees.order('active DESC, last_name')

INSERT INTO "adjustments" ("employee_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["employee_id", 20], ["created_at", "2019-08-01 19:28:15.165414"], ["updated_at", "2019-08-01 19:28:15.165414"]]
---
  def new_adjustment
    if params[:employee_id]
      adj = Adjustment.new(employee_id: params[:employee_id])
      adj.save(validate: false)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def find_employee
    @employee = Employee.find(params[:id])

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT  1 AS one FROM "employees" WHERE "employees"."company_id" = ? AND "employees"."id" = ? LIMIT ?  [["company_id", 4], ["id", 20], ["LIMIT", 1]]
---
  def authorize
    unless current_company.employees.include?(Employee.find(params[:id]))