app/controllers/payrolls_controller.rb

SELECT  "payrolls".* FROM "payrolls" WHERE "payrolls"."company_id" = ? AND "payrolls"."id" = ? LIMIT ?  [["company_id", 4], ["id", 2], ["LIMIT", 1]]
---
  def show
    @payroll = current_company.payrolls.find(params[:id])

UPDATE "payrolls" SET "status" = ?, "updated_at" = ? WHERE "payrolls"."id" = ?  [["status", "Submitted"], ["updated_at", "2019-08-01 19:30:34.768308"], ["id", 2]]
---
  def submit
    @payroll.update(status: "Submitted")

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ? AND "employees"."active" = ? ORDER BY last_name  [["company_id", 4], ["active", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ? AND "employees"."active" = ?  [["company_id", 4], ["active", 1]]
---
  def new
    @payroll = Payroll.new
    # @payroll.status = "Created"
    @employees = current_company.employees.where(active: true)

    @employees.each do |emp|

INSERT INTO "payrolls" ("company_id", "start_date", "end_date", "created_at", "updated_at", "check_date", "status") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "paychecks".* FROM "paychecks" WHERE "paychecks"."payroll_id" = ?  [["payroll_id", 2]]
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "adjustments".* FROM "adjustments" WHERE "adjustments"."employee_id" = ?  [["employee_id", 20]]
INSERT INTO "paychecks" ("payroll_id", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["payroll_id", 2], ["employee_id", 20], ["created_at", "2019-08-01 19:29:59.517946"], ["updated_at", "2019-08-01 19:29:59.517946"]]
INSERT INTO "paycheck_adjustments" ("paycheck_id", "adj_type", "description", "adj_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["paycheck_id", 13], ["adj_type", "Addition"], ["description", "Cool Person Award"], ["adj_amount", 2.5], ["created_at", "2019-08-01 19:29:59.545786"], ["updated_at", "2019-08-01 19:29:59.545786"]]
---
  def create
    @payroll = Payroll.new(payroll_params)
    if @payroll.valid?
      @payroll.status = "Created"
      @payroll.save
      @payroll.paychecks.each do |paych|
        paych.employee.adjustments.each do |adj|
          PaycheckAdjustment.create(paycheck: paych, adj_type: adj.adj_type, description: adj.description, adj_amount: adj.adj_amount)

SELECT  "payrolls".* FROM "payrolls" WHERE "payrolls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "paychecks".* FROM "paychecks" WHERE "paychecks"."payroll_id" = ?  [["payroll_id", 1]]
---
  def analytics_show
    @payroll = Payroll.find(params[:id])
    @hourly_paychecks = @payroll.hourly_paychecks
    @salary_paychecks = @payroll.salary_paychecks
    @display_hours = ["Hours","Vacation Hours", "PTO Hours", "Sick Hours", "Holiday Hours"]
    @hour_types = ["hours","vacation_hours", "pto_hours", "sick_hours", "holiday_hours"]

    @hourly_payout_sum = @hourly_paychecks.sum do |paych|

SELECT  "payrolls".* FROM "payrolls" WHERE "payrolls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_payroll
    @payroll = Payroll.find(params[:id])

SELECT  "payrolls".* FROM "payrolls" WHERE "payrolls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "payrolls" WHERE "payrolls"."company_id" = ? AND "payrolls"."id" = ? LIMIT ?  [["company_id", 4], ["id", 2], ["LIMIT", 1]]
---
  def authorize
    unless current_company.payrolls.include?(Payroll.find(params[:id]))