app/controllers/sessions_controller.rb

  def create
    company = Company.find_by_username(params[:username])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."username" = ? LIMIT ?  [["username", "smartpath"], ["LIMIT", 1]]