app/models/payroll.rb

  def hourly_paychecks
    self.paychecks.select {|p| p.employee.pay_type == "Hourly"}
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "paychecks".* FROM "paychecks" WHERE "paychecks"."payroll_id" = ?  [["payroll_id", 1]]