app/views/layouts/application.html.erb


                  <% current_company.employees.where(active:true).order('last_name').each do |emp| %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ? AND "employees"."active" = ? ORDER BY last_name  [["company_id", 4], ["active", 1]]


                  <% if current_company.employees.where(active: false).any? %>
---
SELECT  1 AS one FROM "employees" WHERE "employees"."company_id" = ? AND "employees"."active" = ? LIMIT ?  [["company_id", 4], ["active", 0], ["LIMIT", 1]]